import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:video_player/video_player.dart';


class MyHomePage extends StatefulWidget {

  @override
  State<MyHomePage> createState() => _MyHomePageState();

}

class _MyHomePageState extends State<MyHomePage> {

  List<String> strs = [""];
  String url="",dara="";
  int ind=0;

  bool _isVisible = false,test=false;

  List<String> content = [""];





  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Padding(
        padding: const EdgeInsets.all(8.0),
        child: SingleChildScrollView(

          child: Column(


            children: [

              Text("BHAKTI SHRADHHA",style:GoogleFonts.quando(textStyle: TextStyle(color: Colors.red,fontWeight: FontWeight.bold,fontSize: 30)), ),
              SizedBox(height: 20,),//just for padding
              Container(
                decoration: new BoxDecoration(border: new Border.all(color: Colors.green,),color: Colors.yellow,),

                height: 40,
                child: Row(
                  mainAxisAlignment: MainAxisAlignment.spaceEvenly,
                  children: [
                    InkWell(
                      child: Text("माता वैष्णो देवी",style: TextStyle(color: Colors.red,fontWeight: FontWeight.bold,fontSize: 20,),),

                  onTap: (){
                        url="https://www.shutterstock.com/image-photo/vaishno-devi-katra-jammu-indiavaishno-260nw-1174801372.jpg";
                        strs = [
                          "दुर्गा देवी स्तुति",
                          "श्रीदुर्गापदुद्धारकस्तोत्रं",
                          "देवी दुर्गा कवच",
                          "जय अम्बे गौरी आरती",
                        ];
                        content=[
                          "या देवी सर्वभूतेषु मातृरुपेण संस्थितः | या देवी सर्वभूतेषु शक्तिरुपेण संस्थितः | \n या देवी सर्वभूतेषु शान्तिरुपेण संस्थितः | नमस्तस्यैः नमस्तस्यैः नमस्तस्यैः नमो नमः | \n ॐ अम्बायै नमः || \n\nअर्थ : देवी माँ की आराधना ! बार-बार उस देवी (देवी) की पूजा करते हैं जो सभी जीवों में माता के रूप में प्रकट होती हैं। उसे प्रणाम! बार-बार उस देवी (देवी) की पूजा करते हैं जो सभी जीवों में ऊर्जा के रूप में प्रकट होती हैं। उसे प्रणाम! बार-बार उस देवी (देवी) की पूजा करते हैं जो सभी जीवों में शांति के रूप में प्रकट होती हैं।\nउसे प्रणाम!",
                          "नमस्ते शरण्ये शिवे सानुकम्पे\nनमस्ते जगद्‍व्यापिके विश्वरूपे ।\nनमस्ते जगद्‍वन्द्यपादारविन्दे\nनमस्ते जगत्तारिणि त्राहि दुर्गे ॥१॥\n\nनमस्ते जगच्चिन्त्यमानस्वरूपे\nनमस्ते महायोगिविज्ञानरूपे ।\nनमस्ते नमस्ते सदानन्द रूपे\nनमस्ते जगत्तारिणि त्राहि दुर्गे ॥२॥\n\nअनाथस्य दीनस्य तृष्णातुरस्य\nभयार्तस्य भीतस्य बद्धस्य जन्तोः ।\nत्वमेका गतिर्देवि निस्तारकर्त्री\nनमस्ते जगत्तारिणि त्राहि दुर्गे ॥३॥\n\nअरण्ये रणे दारुणे शत्रुमध्ये\nजले सङ्कटे राजगेहे प्रवाते ।\nत्वमेका गतिर्देवि निस्तार हेतुर्\nनमस्ते जगत्तारिणि त्राहि दुर्गे ॥४॥\n\nअपारे महदुस्तरेऽत्यन्तघोरे\nविपत् सागरे मज्जतां देहभाजाम् ।\nत्वमेका गतिर्देवि निस्तारनौका\n नमस्ते जगत्तारिणि त्राहि दुर्गे ॥५॥ \n\nनमश्चण्डिके चण्डोर्दण्डलीला\nसमुत्खण्डिता खण्डलाशेषशत्रोः\nत्वमेका गतिर्विघ्नसन्दोहहर्त्री\nनमस्ते जगत्तारिणि त्राहि दुर्गे ॥६॥\n\nत्वमेका सदाराधिता सत्यवादि_\nन्यनेकाखिलाऽक्रोधना क्रोधनिष्ठा ।\nइडा पिङ्ला त्वं सुषुम्ना च नाडी\nनमस्ते जगत्तारिणि त्राहि दुर्गे ॥७॥\nनमो देवि दुर्गे शिवे भीमनादे\nसदासर्वसिद्धिप्रदातृस्वरूपे ।\nविभूतिः सतां कालरात्रिस्वरूपे\nनमस्ते जगत्तारिणि त्राहि दुर्गे ॥८॥\n\nशरणमसि सुराणां सिद्धविद्याधराणां\nमुनिमनुजपशूनां दस्युभिस्त्रासितानाम् ।\nनृपतिगृहगतानां व्याधिभिः पीडितानां\nत्वमसि शरणमेका देवि दुर्गे प्रसीद ॥९॥\n\nइदं स्तोत्रं मया प्रोक्तमापदुद्धारहेतुकम् ।\nत्रिसन्ध्यमेकसन्ध्यं वा पठनाद्घोरसङ्कटात् ॥१०॥\n\nमुच्यते नात्र सन्देहो भुवि स्वर्गे रसातले ।\nसर्वं वा श्लोकमेकं वा यः पठेद्भक्तिमान् सदा ॥११॥\n\nस सर्वं दुष्कृतं त्यक्त्वा प्राप्नोति परमं पदम् ।\nपठनादस्य देवेशि किं न सिद्ध्यति भूतले ॥१२॥\n\nस्तवराजमिदं देवि संक्षेपात्कथितं मया ॥१३॥\n\n॥ इति श्रीसिद्धेश्वरीतन्त्रे उमामहेश्वरसंवादे श्रीदुर्गापदुद्धारस्तोत्रं सम्पूर्णम् ॥",
                          "ॐ नमश्चण्डिकायै।\nॐ यद्गुह्यं परमं लोके सर्वरक्षाकरं नृणाम\nयन्न कस्य चिदाख्यातं तन्मे ब्रूहि पितामह॥1॥\n॥मार्कण्डेय उवाच॥\n\nअस्ति गुह्यतमं विप्रा सर्वभूतोपकारकम्।\nदिव्यास्तु कवचं पुण्यं तच्छृणुष्वा महामुने॥2॥\n\nप्रथमं शैलपुत्री च द्वितीयं ब्रह्मचारिणी।\nतृतीयं चन्द्रघण्टेति कूष्माण्डेति चतुर्थकम्॥3॥\n\nपञ्चमं स्कन्दमातेति षष्ठं कात्यायनीति च\nसप्तमं कालरात्रीति महागौरीति चाष्टमम्॥4॥\n\nनवमं सिद्धिदात्री च नव दुर्गाः प्रकीर्तिताः।\nउक्तान्येतानि नामानि ब्रह्मणैव महात्मना॥5॥\n\nअग्निना दह्यमानस्तु शत्रुमध्ये गतो रणे।\nविषमे दुर्गमे चैव भयार्ताः शरणं गताः॥6॥\n\nन तेषां जायते किञ्चिदशुभं रणसङ्कटे।\nनापदं तस्य पश्यामि शोकदुःखभयं न ही॥7॥\n\nयैस्तु भक्त्या स्मृता नूनं तेषां वृद्धिः प्रजायते।\nये त्वां स्मरन्ति देवेशि रक्षसे तान्न संशयः॥8॥\n\nप्रेतसंस्था तु चामुण्डा वाराही महिषासना।\nऐन्द्री गजसमारूढा वैष्णवी गरुडासना॥9॥\n\nमाहेश्वरी वृषारूढा कौमारी शिखिवाहना।\nलक्ष्मी: पद्मासना देवी पद्महस्ता हरिप्रिया॥10॥\n\nश्वेतरूपधारा देवी ईश्वरी वृषवाहना।\nब्राह्मी हंससमारूढा सर्वाभरणभूषिता॥ 11॥\n\nइत्येता मातरः सर्वाः सर्वयोगसमन्विताः।\nनानाभरणशोभाढया नानारत्नोपशोभिता:॥ 12॥\n\nदृश्यन्ते रथमारूढा देव्याः क्रोधसमाकुला:।\nशङ्खं चक्रं गदां शक्तिं हलं च मुसलायुधम्॥13\nखेटकं तोमरं चैव परशुं पाशमेव च।\nकुन्तायुधं त्रिशूलं च शार्ङ्गमायुधमुत्तमम्॥ 14॥\nदैत्यानां देहनाशाय भक्तानामभयाय च।\nधारयन्त्यायुद्धानीथं देवानां च हिताय वै॥ 15॥\n\nनमस्तेऽस्तु महारौद्रे महाघोरपराक्रमे।\nमहाबले महोत्साहे महाभयविनाशिनि॥16॥\n\nत्राहि मां देवि दुष्प्रेक्ष्ये शत्रूणां भयवर्धिनि।\n्राच्यां रक्षतु मामैन्द्रि आग्नेय्यामग्निदेवता॥ 17॥\nदक्षिणेऽवतु वाराही नैऋत्यां खङ्गधारिणी।\nप्रतीच्यां वारुणी रक्षेद् वायव्यां मृगवाहिनी॥ 18॥\n\nउदीच्यां पातु कौमारी ऐशान्यां शूलधारिणी।\nऊर्ध्वं ब्रह्माणी में रक्षेदधस्ताद् वैष्णवी तथा॥ 19॥\n\nएवं दश दिशो रक्षेच्चामुण्डा शववाहाना।\nजाया मे चाग्रतः पातु: विजया पातु पृष्ठतः॥ 20॥\n\nअजिता वामपार्श्वे तु दक्षिणे चापराजिता।\nशिखामुद्योतिनि रक्षेदुमा मूर्ध्नि व्यवस्थिता॥21॥\n\nमालाधारी ललाटे च भ्रुवो रक्षेद् यशस्विनी।\nत्रिनेत्रा च भ्रुवोर्मध्ये यमघण्टा च नासिके॥ 22॥\n\nशङ्खिनी चक्षुषोर्मध्ये श्रोत्रयोर्द्वारवासिनी।\nकपोलौ कालिका रक्षेत्कर्णमूले तु शङ्करी ॥ 23॥\n\nनासिकायां सुगन्‍धा च उत्तरोष्ठे च चर्चिका।\nअधरे चामृतकला जिह्वायां च सरस्वती॥ 24॥\n\nदन्तान् रक्षतु कौमारी कण्ठदेशे तु चण्डिका।\nघण्टिकां चित्रघण्टा च महामाया च तालुके॥ 25॥\n\nकामाक्षी चिबुकं रक्षेद्‍ वाचं मे सर्वमङ्गला।\nग्रीवायां भद्रकाली च पृष्ठवंशे धनुर्धारी॥ 26॥\n\nनीलग्रीवा बहिःकण्ठे नलिकां नलकूबरी।\nस्कन्धयोः खङ्गिनी रक्षेद्‍ बाहू मे वज्रधारिणी॥27॥\n\nहस्तयोर्दण्डिनी रक्षेदम्बिका चान्गुलीषु च।\nनखाञ्छूलेश्वरी रक्षेत्कुक्षौ रक्षेत्कुलेश्वरी॥28॥\n\nस्तनौ रक्षेन्‍महादेवी मनः शोकविनाशिनी।\nहृदये ललिता देवी उदरे शूलधारिणी॥ 29॥\n\nनाभौ च कामिनी रक्षेद्‍ गुह्यं गुह्येश्वरी तथा।\nपूतना कामिका मेढ्रं गुडे महिषवाहिनी॥30॥\nकट्यां भगवतीं रक्षेज्जानूनी विन्ध्यवासिनी।\nजङ्घे महाबला रक्षेत्सर्वकामप्रदायिनी॥31॥\n\nगुल्फयोर्नारसिंही च पादपृष्ठे तु तैजसी।\nपादाङ्गुलीषु श्रीरक्षेत्पादाध:स्तलवासिनी॥32॥\n\nनखान् दंष्ट्रा कराली च केशांशचैवोर्ध्वकेशिनी।\nरोमकूपेषु कौबेरी त्वचं वागीश्वरी तथा॥33॥\n\nरक्तमज्जावसामांसान्यस्थिमेदांसि पार्वती।\n\nअन्त्राणि कालरात्रिश्च पित्तं च मुकुटेश्वरी॥ 34 ॥\nपद्मावती पद्मकोशे कफे चूडामणिस्तथा।\nज्वालामुखी नखज्वालामभेद्या सर्वसन्धिषु॥35 ॥\n\nशुक्रं ब्रह्माणी मे रक्षेच्छायां छत्रेश्वरी तथा।\nअहङ्कारं मनो बुद्धिं रक्षेन्मे धर्मधारिणी॥36॥\n\nप्राणापानौ तथा व्यानमुदानं च समानकम्।\nवज्रहस्ता च मे रक्षेत्प्राणं कल्याणशोभना॥37॥\n\nरसे रूपे च गन्धे च शब्दे स्पर्शे च योगिनी।\nसत्वं रजस्तमश्चैव रक्षेन्नारायणी सदा॥38॥\n\nआयू रक्षतु वाराही धर्मं रक्षतु वैष्णवी।\nयशः कीर्तिं च लक्ष्मीं च धनं विद्यां च चक्रिणी॥39॥\n\nपन्थानं सुपथा रक्षेन्मार्गं क्षेमकरी तथा।\nराजद्वारे महालक्ष्मीर्विजया सर्वतः स्थिता॥ 41॥\n\nरक्षाहीनं तु यत्स्थानं वर्जितं कवचेन तु।\nतत्सर्वं रक्ष मे देवी जयन्ती पापनाशिनी॥ 42॥\n\nरक्षाहीनं तु यत्स्थानं वर्जितं कवचेन तु।\nतत्सर्वं रक्ष मे देवी जयन्ती पापनाशिनी॥43॥\nपदमेकं न गच्छेतु यदिच्छेच्छुभमात्मनः।\nकवचेनावृतो नित्यं यात्र यत्रैव गच्छति॥44॥\nतत्र तत्रार्थलाभश्च विजयः सर्वकामिकः।\nयं यं चिन्तयते कामं तं तं प्राप्नोति निश्चितम्।\nपरमैश्वर्यमतुलं प्राप्स्यते भूतले पुमान्॥45॥\n\nनिर्भयो जायते मर्त्यः सङ्ग्रमेष्वपराजितः।\nत्रैलोक्ये तु भवेत्पूज्यः कवचेनावृतः पुमान्॥46॥\n\nइदं तु देव्याः कवचं देवानामपि दुर्लभम्।\nय: पठेत्प्रयतो नित्यं त्रिसन्ध्यं श्रद्धयान्वितः॥47॥\nदैवी कला भवेत्तस्य त्रैलोक्येष्वपराजितः।\nजीवेद् वर्षशतं साग्रामपमृत्युविवर्जितः॥48॥\n\nनश्यन्ति टयाधय: सर्वे लूताविस्फोटकादयः।\nस्थावरं जङ्गमं चैव कृत्रिमं चापि यद्विषम्॥ 49॥\nअभिचाराणि सर्वाणि मन्त्रयन्त्राणि भूतले।\nभूचराः खेचराशचैव जलजाश्चोपदेशिकाः॥50॥\nसहजा कुलजा माला डाकिनी शाकिनी तथा।\nअन्तरिक्षचरा घोरा डाकिन्यश्च महाबला॥ 51॥\nग्रहभूतपिशाचाश्च यक्षगन्धर्वराक्षसा:।\nब्रह्मराक्षसवेतालाः कूष्माण्डा भैरवादयः॥ 52॥\nनश्यन्ति दर्शनात्तस्य कवचे हृदि संस्थिते।\nमानोन्नतिर्भावेद्राज्यं तेजोवृद्धिकरं परम्॥ 53॥\n\nनश्यन्ति दर्शनात्तस्य कवचे हृदि संस्थिते।\nमानोन्नतिर्भावेद्राज्यं तेजोवृद्धिकरं परम्॥ 54॥\nयशसा वद्धते सोऽपी कीर्तिमण्डितभूतले।\nजपेत्सप्तशतीं चणण्डीं कृत्वा तु कवचं पूरा॥ 55॥\nयावद्भूमण्डलं धत्ते सशैलवनकाननम्।\nतावत्तिष्ठति मेदिनयां सन्ततिः पुत्रपौत्रिकी॥56॥\n\nदेहान्ते परमं स्थानं यात्सुरैरपि दुर्लभम्।\nप्राप्नोति पुरुषो नित्यं महामायाप्रसादतः॥57॥\nलभते परमं रूपं शिवेन सह मोदते ॥ॐ॥ ॥ 58॥\n\n\n।। इति देव्या: कवचं सम्पूर्णम् ।",
                          "जय अम्बे गौरी\nमैया जय श्यामा गौरी\nतुमको निशिदिन ध्यावत\nतुमको निशिदिन ध्यावत\nहरि ब्रह्मा शिवरी\nॐ जय अम्बे गौरी\nजय अम्बे गौरी\nमैया जय श्यामा गौरी\nतुमको निशिदिन ध्यावत\nतुमको निशिदिन ध्यावत\nहरि ब्रह्मा शिवरी\nॐ जय अम्बे गौरी\nमांग सिंदूर विराजित\nटीको जगमग तो\nमैया टीको जगमग तो\nउज्ज्वल से दोउ नैना\nउज्ज्वल से दोउ नैना\nचंद्रवदन नीको\nॐ जय अम्बे गौरी\nकनक समान कलेवर\nरक्ताम्बर राजै\nमैया रक्ताम्बर राजै\nरक्तपुष्प गल माला\nरक्तपुष्प गल माला\nकंठन पर साजै\nॐ जय अम्बे गौरी\nकेहरि वाहन राजत\nखड्ग खप्पर धारी\nमैया खड्ग खप्पर धारी\nसुर नर मुनिजन सेवत\nसुर नर मुनिजन सेवत\nतिनके दुखहारी\nॐ जय अम्बे गौरी\nकानन कुण्डल शोभित नासाग्रे मोती\nमैया नासाग्रे मोती\nकोटिक चंद्र दिवाकर\nकोटिक चंद्र दिवाकर\nसम राजत ज्योती\nॐ जय अम्बे गौरी\nशुंभ निशुंभ बिदारे महिषासुर घाती\nमैया महिषासुर घाती\nधूम्र विलोचन नैना\nधूम्र विलोचन नैना\nनिशदिन मदमाती\nॐ जय अम्बे गौरी\nचण्ड-मुण्ड संहारे शोणित बीज हरे\nमैया शोणित बीज हरे\nमधु कैटभ दोउ मारे\nमधु कैटभ दोउ मारे\nसुर भयहिन करे\nॐ जय अम्बे गौरी\nब्रहमाणी रुद्राणी तुम कमला रानी\nमैया तुम कमला रानी\nअगम निगम बखानी\nअगम निगम बखानी\nतुम शिव पटरानी\nॐ जय अम्बे गौरी\nचौंसठ योगिनी गावत नृत्य करत भैरों\nमैया नृत्य करत भैरों\nबाजत ताल मृदंगा\nबाजत ताल मृदंगा\nओर बाजत डमरू\nॐ जय अम्बे गौरी\nतुम ही जग की माता तुम ही हो भरता\nमैया तुम ही हो भरता\nभक्तन की दुख हरता\nभक्तन की दुख हरता\nसुख संपति करता\nॐ जय अम्बे गौरी\nभुजा चार अति शोभित वर-मुद्रा धारी\nमैया वर मुद्रा धारी\nमनवांछित फल पावत\nमनवांछित फल पावत\nसेवत नर नारी\nॐ जय अम्बे गौरी\nकंचन ढाल विराजत अगर कपूर बाती\nमैया अगर कपूर बाती\nश्रीमालकेतु में राजत\nश्रीमालकेतु में राजत\nकोटि रतन ज्योती\nॐ जय अम्बे गौरी\nश्री अम्बे जी की आरती\nजो कोई नर गावे\nमैया जो कोई नर गावे\nकहते शिवानंद स्वामी\nकहते शिवानंद स्वामी\nसुख सम्पति पावे\nॐ जय अम्बे गौरी\nजय अम्बे गौरी\nमैया जय श्यामा गौरी\nतुमको निशिदिन ध्यावत\nतुमको निशिदिन ध्यावत\nहरि ब्रह्मा शिवरी\nॐ जय अम्बे गौरी\n"

                        ];
                        ind=0;
                        test=false;
                          setState(() {
                            _isVisible = true;

                          });
                        },
                        ),
                    InkWell(
                      child: Text("महाकालेश्वर",style:TextStyle(color: Colors.red,fontWeight: FontWeight.bold,fontSize: 20),),

                      onTap: (){
                        url="https://spiderimg.amarujala.com/cdn-cgi/image/width=674,height=379.25,fit=cover,f=auto/assets/images/2020/02/21/750x506/mahakal_1582256124.png";
                        strs = [
                          "महामृत्युंजय मंत्र",
                          "ॐ शंकर शिव भोले उमापति महादेव - भजन",
                          "आरती : जय शिव ओंकारा"
                        ];
                        test=false;
                        content=[
                          "ॐ त्र्यम्बकं यजामहे सुगन्धिं पुष्टिवर्धनम् ।\nउर्वारुकमिव बन्धनान्मृत्योर्मुक्षीय माऽमृतात् ॥",
                          "ॐ\nशंकर शिव भोले उमापति महादेव\nशंकर शिव भोले उमापति महादेव\nपालनहार परमेश्वर, विश्वरूप महादेव\nपालनहार परमेश्वर, विश्वरूप महादेव\nमहादेव, महादेव, महादेव...\n\nमहेशम् सुरेशम सुरारती नाशम, सुरारती नाशम\nविभूम विश्वनताम, विभुत्यांग भूषं\nविभूम विश्वनताम, विभुत्यांग भूषं\nतिरूपाक्षहमितवार कृपहुँ त्रिनेत्रम\nतिरूपाक्षहमितवार कृपहुँ त्रिनेत्रम\nसदानन्द निमें प्रभु पंचबद्रम\nसदानन्द निमें प्रभु पंचबद्रम\nनमस्ते नमस्ते विभोविश्वमूर्ते\n\nशंकर शिव भोले उमापति महादेव\nशंकर शिव भोले उमापति महादेव\nपालनहार परमेश्वर, विश्वरूप महादेव\nपालनहार परमेश्वर, विश्वरूप महादेव\nमहादेव, महादेव, महादेव...\n\nतत्व जगतभवती देवभवस्मरारे\nत्वयेव तिस्टति जगन मिड्ड विश्वनाथ\nतत्व जगतभवती देवभवस्मरारे\nत्वयेव तिस्टति जगन मिड्ड विश्वनाथ\nत्वयेव गच्छति लयम् जगदीश्वर\nलिंगात्मकम हारस्चरात चरः विश्वरूपिंग\nनमस्ते नमस्ते तपो योग गम्याः\n\nशंकर शिव भोले उमापति महादेव\nशंकर शिव भोले उमापति महादेव\nपालनहार परमेश्वर, विश्वरूप महादेव\nपालनहार परमेश्वर, विश्वरूप महादेव\nमहादेव, महादेव, महादेव...\n\nॐ नमः शिवाय, ॐ नमः शिवाय, ॐ नमः शिवाय...",
                          "ओम जय शिव ओंकारा, स्वामी जय शिव ओंकारा। ब्रह्मा, विष्णु, सदाशिव, अर्द्धांगी धारा॥\nओम जय शिव ओंकारा॥\n\nएकानन चतुरानन पञ्चानन राजे। हंसासन गरूड़ासन वृषवाहन साजे॥\nओम जय शिव ओंकारा॥\n\nदो भुज चार चतुर्भुज दसभुज अति सोहे। त्रिगुण रूप निरखते त्रिभुवन जन मोहे॥\nओम जय शिव ओंकारा॥\n\nअक्षमाला वनमाला मुण्डमालाधारी। त्रिपुरारी कंसारी कर माला धारी॥\nओम जय शिव ओंकारा॥\n\nश्वेताम्बर पीताम्बर बाघंबर अंगे। सनकादिक गरुड़ादिक भूतादिक संगे॥\nओम जय शिव ओंकारा॥\n\nकर के मध्य कमण्डलु चक्र त्रिशूलधारी। सुखकारी दुखहारी जगपालनकारी॥\nओम जय शिव ओंकारा॥\n\nब्रह्मा विष्णु सदाशिव जानत अविवेका। मधु-कैटभ दो‌उ मारे, सुर भयहीन करे॥\nओम जय शिव ओंकारा॥\n\nलक्ष्मी, सावित्री पार्वती संगा। पार्वती अर्द्धांगी, शिवलहरी गंगा॥\nओम जय शिव ओंकारा॥\n\nपर्वत सोहैं पार्वती, शंकर कैलासा। भांग धतूर का भोजन, भस्मी में वासा॥\nओम जय शिव ओंकारा॥\n\nजटा में गंग बहत है, गल मुण्डन माला। शेष नाग लिपटावत, ओढ़त मृगछाला॥\nओम जय शिव ओंकारा॥\n\nकाशी में विराजे विश्वनाथ, नन्दी ब्रह्मचारी। नित उठ दर्शन पावत, महिमा अति भारी॥\nओम जय शिव ओंकारा॥\n\nत्रिगुणस्वामी जी की आरति जो कोइ नर गावे। कहत शिवानन्द स्वामी, मनवान्छित फल पावे॥\nओम जय शिव ओंकारा॥ ओम जय शिव ओंकारा॥\n\n"
                        ];
                        ind=0;
                        setState(() {
                          _isVisible = true;

                        });
                      },
                    ),
                     ],

                ),
              ),
              SizedBox(height: 20,),

              Visibility(
                visible: _isVisible,
                child: Column(

                  children: [
                    Image.network(url),
                    Container(

                      child:
                          ListView(
                              shrinkWrap: true,

                            children:strs.map((strone){
                              return Container(
                                    decoration: new BoxDecoration(border: new Border.all(color: Colors.pink,),color: Colors.amber,borderRadius: BorderRadius.all(Radius.circular(20))),

                                    child: InkWell(child: Text(strone),onTap:(){
                                        setState(() {
                                          dara=strone;
                                          test=true;
                                          ind= strs.indexOf(strone);
                                        });


                                    } ,),
                                    margin: EdgeInsets.all(5),
                                    padding: EdgeInsets.all(15),

                                   // color: Colors.green[100],

                              );

                            }

                            ).toList(),
                          ),




                      ),

                    SizedBox(width: 20,height: 20,),




                    Padding(
                      padding: const EdgeInsets.all(8.0),
                      child: Container(

                        decoration: new BoxDecoration(border: new Border.all(color: Colors.indigo,),color: Colors.red,borderRadius: BorderRadius.all(Radius.circular(20))),

                        child: Visibility(
                            visible: test,
                            child: Padding(
                              padding: const EdgeInsets.all(16.0),
                              child: Text(content[ind],style: TextStyle(fontSize: 20),),
                            )
                        ),
                      ),
                    ),


                  ],
                ),
              ),






            ],
          ),
        ),
      ),

    );
  }
}